FranciszekJanicki/devcontainer-stm32-cubemx-invertedsway/Core/Src/mpu6050.cpp
#include "mpu6050.hpp"
#include "common.hpp"
#include "main.h"
#include "stm32l4xx_hal_i2c.h"
#include <cmath>
#include <cstddef>
#include <cstdint>
#include <cstdio>
#include <expected>

namespace InvertedSway {

    using Error = MPU6050::Error;
    using Scaled = MPU6050::Scaled;
    using GyroScaled = MPU6050::GyroScaled;
    using AccelScaled = MPU6050::AccelScaled;
    using RollPitchYaw = MPU6050::RollPitchYaw;
    using TempScaled = MPU6050::TempScaled;
    using Raw = MPU6050::Raw;
    using GyroRaw = MPU6050::GyroRaw;
    using AccelRaw = MPU6050::AccelRaw;
    using TempRaw = MPU6050::TempRaw;
    using GyroFilter = MPU6050::GyroFilter;
    using AccelFilter = MPU6050::AccelFilter;

    const char* MPU6050::error_to_string(const Error error) noexcept
    {
        switch (error) {
            case Error::OK:
                return "OK ERROR";
            case Error::INIT:
                return "INIT ERROR";
            case Error::DEINIT:
                return "DEINIT ERROR";
            case Error::ACCEL:
                return "ACCEL ERROR";
            case Error::GYRO:
                return "GYRO ERROR";
            case Error::TEMP:
                return "TEMP ERROR";
            default:
                return "NONE ERROR";
        }
    }

    GyroFilter MPU6050::make_gyro_filter() noexcept
    {
        return make_recursive_average<GyroRaw, Raw>();
    }

    AccelFilter MPU6050::make_accel_filter() noexcept
    {
        return make_recursive_average<AccelRaw, Raw>();
    }

    Scaled MPU6050::gyro_range_to_scale(const std::uint8_t gyro_range) noexcept
    {
        switch (gyro_range) {
            case GYRO_FS_250:
                return 131.0f;
            case GYRO_FS_500:
                return 65.5f;
            case GYRO_FS_1000:
                return 32.8f;
            case GYRO_FS_2000:
                return 16.4f;
            default:
                return 0.0f;
        }
    }

    Scaled MPU6050::accel_range_to_scale(const std::uint8_t accel_range) noexcept
    {
        switch (accel_range) {
            case ACCEL_FS_2:
                return 16384.0f;
            case ACCEL_FS_4:
                return 8192.0f;
            case ACCEL_FS_8:
                return 4096.0f;
            case ACCEL_FS_16:
                return 2048.0f;
            default:
                return 0.0f;
        }
    }

    MPU6050::MPU6050(I2cHandle i2c,
                     const std::uint8_t addres,
                     const std::uint8_t gyro_range,
                     const std::uint8_t accel_range,
                     GyroFilter&& gyro_filter,
                     AccelFilter&& accel_filter) noexcept :
        i2c_{i2c},
        address_{addres},
        gyro_range_{gyro_range},
        accel_range_{accel_range},
        gyro_filter_{gyro_filter},
        accel_filter_{accel_filter}
    {
        this->initialize();
    }

    MPU6050::MPU6050(I2cHandle i2c,
                     const std::uint8_t addres,
                     const std::uint8_t gyro_range,
                     const std::uint8_t accel_range) noexcept :
        i2c_{i2c}, address_{addres}, gyro_range_{gyro_range}, accel_range_{accel_range}

    {
        this->initialize();
    }

    MPU6050::~MPU6050() noexcept
    {
        this->deinitialize();
    }

    void MPU6050::initialize() noexcept
    {
        if (HAL_I2C_IsDeviceReady(this->i2c_, this->address_, 10, I2C_TIMEOUT) != HAL_OK) {
            printf("device is not ready\r\n");
            return;
        }

        if (this->get_device_id() == this->address_) {
            this->device_reset(1);
            HAL_Delay(50);
            this->set_sleep_enabled(0);
            HAL_Delay(100);
            // this->set_clock_source(CLOCK_INTERNAL);
            // HAL_Delay(50);
            this->set_sampling_rate(200);
            HAL_Delay(50);
            this->set_dlpf(DLPF_BW_256);
            HAL_Delay(50);
            this->set_full_scale_gyro_range(this->gyro_range_);
            HAL_Delay(50);
            this->set_full_scale_accel_range(this->accel_range_);
            HAL_Delay(50);
            this->set_interrupt();
        }
    }

    void MPU6050::deinitialize() noexcept
    {
        if (this->get_device_id() == this->address_) {
            this->device_reset(1);
        }
    }

    void MPU6050::set_dlpf(const std::uint8_t value) const noexcept
    {
        std::uint8_t buffer = value & 0x7;
        HAL_I2C_Mem_Write(this->i2c_,
                          this->address_,
                          RA_CONFIG,
                          sizeof(RA_CONFIG),
                          &buffer,
                          sizeof(buffer),
                          I2C_TIMEOUT);
    }

    void MPU6050::device_reset(const std::uint8_t reset) const noexcept
    {
        std::uint8_t buffer = (reset & 1U) << PWR1_DEVICE_RESET_BIT;
        HAL_I2C_Mem_Write(this->i2c_,
                          this->address_,
                          RA_PWR_MGMT_1,
                          sizeof(RA_PWR_MGMT_1),
                          &buffer,
                          sizeof(buffer),
                          I2C_TIMEOUT);
    }

    void MPU6050::set_sampling_rate(const std::uint8_t rate) const noexcept
    {
        std::uint8_t buffer = (1000 * GYRO_OUTPUT_RATE_KHZ / rate) - 1;
        HAL_I2C_Mem_Write(this->i2c_,
                          this->address_,
                          RA_SMPLRT_DIV,
                          sizeof(RA_SMPLRT_DIV),
                          &buffer,
                          sizeof(buffer),
                          I2C_TIMEOUT);
    }

    void MPU6050::set_sleep_enabled(const std::uint8_t enable) const noexcept
    {
        std::uint8_t buffer = (enable & 1U) << PWR1_SLEEP_BIT;
        HAL_I2C_Mem_Write(this->i2c_,
                          this->address_,
                          RA_PWR_MGMT_1,
                          sizeof(RA_PWR_MGMT_1),
                          &buffer,
                          sizeof(buffer),
                          I2C_TIMEOUT);
    }

    void MPU6050::set_cycle_enabled(const std::uint8_t enable) const noexcept
    {
        std::uint8_t buffer = (enable & 1U) << PWR1_CYCLE_BIT;
        HAL_I2C_Mem_Write(this->i2c_,
                          this->address_,
                          RA_PWR_MGMT_1,
                          sizeof(RA_PWR_MGMT_1),
                          &buffer,
                          sizeof(buffer),
                          I2C_TIMEOUT);
    }

    void MPU6050::set_temperature_sensor_disabled(const std::uint8_t disable) const noexcept
    {
        std::uint8_t buffer = (disable & 1U) << PWR1_TEMP_DIS_BIT;
        HAL_I2C_Mem_Write(this->i2c_,
                          this->address_,
                          RA_PWR_MGMT_1,
                          sizeof(RA_PWR_MGMT_1),
                          &buffer,
                          sizeof(buffer),
                          I2C_TIMEOUT);
    }

    void MPU6050::set_clock_source(const std::uint8_t source) const noexcept
    {
        std::uint8_t buffer = (source & 0x7);
        HAL_I2C_Mem_Write(this->i2c_,
                          this->address_,
                          RA_PWR_MGMT_1,
                          sizeof(RA_PWR_MGMT_1),
                          &buffer,
                          sizeof(buffer),
                          I2C_TIMEOUT);
    }

    void MPU6050::set_low_power_wake_up_frequency(const std::uint8_t frequency) const noexcept
    {
        std::uint8_t buffer = (frequency & 0x3) << PWR2_LP_WAKE_CTRL_BIT;
        HAL_I2C_Mem_Write(this->i2c_,
                          this->address_,
                          RA_PWR_MGMT_2,
                          sizeof(RA_PWR_MGMT_2),
                          &buffer,
                          sizeof(buffer),
                          I2C_TIMEOUT);
    }

