FranciszekJanicki/devcontainer-stm32-cubemx-invertedsway/Core/Src/mpu6050.cpp
    void MPU6050::accelerometer_axis_standby(const std::uint8_t x_accel_standby,
                                             const std::uint8_t y_accel_standby,
                                             const std::uint8_t z_accel_standby) const noexcept
    {
        std::uint8_t buffer = ((x_accel_standby & 1U) << PWR2_STBY_XA_BIT) |
                              ((y_accel_standby & 1U) << PWR2_STBY_YA_BIT) |
                              ((z_accel_standby & 1U) << PWR2_STBY_ZA_BIT);
        HAL_I2C_Mem_Write(this->i2c_,
                          this->address_,
                          RA_PWR_MGMT_2,
                          sizeof(RA_PWR_MGMT_2),
                          &buffer,
                          sizeof(buffer),
                          I2C_TIMEOUT);
    }

    void MPU6050::gyroscope_axis_standby(const std::uint8_t x_gyro_standby,
                                         const std::uint8_t y_gyro_standby,
                                         const std::uint8_t z_gyro_standby) const noexcept
    {
        std::uint8_t buffer = ((x_gyro_standby & 1U) << PWR2_STBY_XG_BIT) |
                              ((y_gyro_standby & 1U) << PWR2_STBY_YG_BIT) | ((z_gyro_standby & 1U) << PWR2_STBY_ZG_BIT);
        HAL_I2C_Mem_Write(this->i2c_,
                          this->address_,
                          RA_PWR_MGMT_2,
                          sizeof(RA_PWR_MGMT_2),
                          &buffer,
                          sizeof(buffer),
                          I2C_TIMEOUT);
    }

    void MPU6050::set_full_scale_gyro_range(const std::uint8_t range) const noexcept
    {
        std::uint8_t buffer = (range & 0x7) << 3;
        HAL_I2C_Mem_Write(this->i2c_,
                          this->address_,
                          RA_GYRO_CONFIG,
                          sizeof(RA_GYRO_CONFIG),
                          &buffer,
                          sizeof(buffer),
                          I2C_TIMEOUT);
    }

    void MPU6050::set_full_scale_accel_range(const std::uint8_t range) const noexcept
    {
        std::uint8_t buffer = (range & 0x7) << 3;
        HAL_I2C_Mem_Write(this->i2c_,
                          this->address_,
                          RA_ACCEL_CONFIG,
                          sizeof(RA_ACCEL_CONFIG),
                          &buffer,
                          sizeof(buffer),
                          I2C_TIMEOUT);
    }

    TempRaw MPU6050::get_temperature_raw() const noexcept
    {
        std::uint8_t buffer[2];
        HAL_I2C_Mem_Read(this->i2c_,
                         this->address_,
                         RA_TEMP_OUT_H,
                         sizeof(RA_TEMP_OUT_H),
                         buffer,
                         sizeof(buffer),
                         I2C_TIMEOUT);
        return ((static_cast<TempRaw>(buffer[0])) << 8) | buffer[1];
    }

    TempScaled MPU6050::get_temperature_celsius() const noexcept
    {
        return static_cast<TempScaled>(this->get_temperature_raw()) / 340 + 36.53;
    }

    Raw MPU6050::get_acceleration_x_raw() const noexcept
    {
        std::uint8_t buffer[2];
        HAL_I2C_Mem_Read(this->i2c_,
                         this->address_,
                         RA_ACCEL_XOUT_H,
                         sizeof(RA_ACCEL_XOUT_H),
                         buffer,
                         sizeof(buffer),
                         I2C_TIMEOUT);
        return ((static_cast<Raw>(buffer[0])) << 8) | buffer[1];
    }

    Raw MPU6050::get_acceleration_y_raw() const noexcept
    {
        std::uint8_t buffer[2];
        HAL_I2C_Mem_Read(this->i2c_,
                         this->address_,
                         RA_ACCEL_YOUT_H,
                         sizeof(RA_ACCEL_YOUT_H),
                         buffer,
                         sizeof(buffer),
                         I2C_TIMEOUT);
        return ((static_cast<Raw>(buffer[0])) << 8) | buffer[1];
    }

    Raw MPU6050::get_acceleration_z_raw() const noexcept
    {
        std::uint8_t buffer[2];
        HAL_I2C_Mem_Read(this->i2c_,
                         this->address_,
                         RA_ACCEL_ZOUT_H,
                         sizeof(RA_ACCEL_ZOUT_H),
                         buffer,
                         sizeof(buffer),
                         I2C_TIMEOUT);
        return ((static_cast<Raw>(buffer[0])) << 8) | buffer[1];
    }

    AccelRaw MPU6050::get_accelerometer_raw() const noexcept
    {
        std::uint8_t buffer[6];
        HAL_I2C_Mem_Read(this->i2c_,
                         this->address_,
                         RA_ACCEL_XOUT_H,
                         sizeof(RA_ACCEL_XOUT_H),
                         buffer,
                         sizeof(buffer),
                         I2C_TIMEOUT);

        return this->accel_filter_(AccelRaw{((static_cast<Raw>(buffer[0])) << 8) | buffer[1],
                                            ((static_cast<Raw>(buffer[2])) << 8) | buffer[3],
                                            ((static_cast<Raw>(buffer[4])) << 8) | buffer[5]});
    }

    AccelScaled MPU6050::get_accelerometer_scaled() const noexcept
    {
        const auto accel_scale{accel_range_to_scale(this->accel_range_)};
        const auto accel_raw_result{this->get_accelerometer_raw()};
        return AccelScaled{static_cast<Scaled>(accel_raw_result.x) / accel_scale,
                           static_cast<Scaled>(accel_raw_result.y) / accel_scale,
                           static_cast<Scaled>(accel_raw_result.z) / accel_scale};
    }

    Raw MPU6050::get_rotation_x_raw() const noexcept
    {
        std::uint8_t buffer[2];
        HAL_I2C_Mem_Read(this->i2c_,
                         this->address_,
                         RA_GYRO_XOUT_H,
                         sizeof(RA_GYRO_XOUT_H),
                         buffer,
                         sizeof(buffer),
                         I2C_TIMEOUT);
        return ((static_cast<Raw>(buffer[0])) << 8) | buffer[1];
    }

    Raw MPU6050::get_rotation_y_raw() const noexcept
    {
        std::uint8_t buffer[2];
        HAL_I2C_Mem_Read(this->i2c_,
                         this->address_,
                         RA_GYRO_YOUT_H,
                         sizeof(RA_GYRO_YOUT_H),
                         buffer,
                         sizeof(buffer),
                         I2C_TIMEOUT);
        return ((static_cast<Raw>(buffer[0])) << 8) | buffer[1];
    }

